import pandas as a
#Этой командой мы импортируем библиотеку для анализа данных    
data = {'ФИО' : 
            ['Петров Петр Петрович', 
            'Павлешевич Павел Палыч',
            'Алексадревич Александ Александрочич'] ,
        'Адрес':
             ['г.Минск ул.Пушкина д.Колотушкина',
             'г.Барановичи ул.Петровская д.19', 
             'г.Гродон ул.Павлика д.5'],
        'Телефон':
            ['+375294859656',
            '+375339876543',
            '+375301234567'], 
        'Дата рождения':
            ['17.08.2001',
            '31.04.20020',
            '24.09.1999']}
#Задали изначальные данные нашей записной книжки (словаря) pandas
d = a.DataFrame(data)
#Эта команда берёт наш словарь в котором данные лежат в виде списков и превращает их в структурированную двумерную таблицу DataFrame
print(d)
while True:
    print('Выберите действие: ')
    print('1.Удалить запись')
    print('2.Изменить запись')
    print('3.Добавить запись')
    print('4.Выход из программы')
    print('5.Просмотр адресной книги')
    #Перечисляем все опции котоые может выбрать пользоатель 
    de= input()
    #Пользователь выбирает опцию
    if de == '1' :
    #В случае если пользователь ввел 1 эта наша первая команда (Удаление данных) это воспроизводит следующие монипуляции
        print('Удаление записи ')
        yd = int(input('Введите номер строки (индекс): '))
        #Вводим индекс строки которую нужно удалить
        if yd in d.index: 
        #Проверка существует ли страка в нашей книжке
            d = d.drop(yd).reset_index(drop=True)
            #Эти две строчкт говорят что если строка с таким номером существует, удали её и заново пересчитай порядковые номера всех оставшихся строк
            print(f'удалено для {yd} строки')
        else:
                print('Ошибка при вводе строки')
        
    elif de == '2':
    #В случае если пользователь ввел 2 эта наша вторая команда (Изменение данных) это воспроизводит следующие монипуляции
        print('Изменение записи ')
        yd = int(input('Введите номер строки (индекс): '))
        #Вводим индекс строки которую нужно изменить
        if yd in d.index: 
        #Проверка существует ли страка в нашей книжке
            print('Что именно вы хотите изменить?: (Варианты: ФИО, Адрес, Телефон, Дата рождения)')
            #Выбираем столбец в которой вносим изменения
            cl = input('Введите критерий данных который вы хотите тзменить?: ')
            if cl in d.columns:
            #Существует ли такой столбец
                iz = input('Введите новые данные: ')
                d.loc[yd , cl] = iz
                #Эта команда меняет значение размещения [yd , cl] на новые введенные iz
                print(f'Значение {cl} для строки {yd} изменено на {iz}')
            else:
                print('Ошибка при вводе критерия')
        else:
            print('Ошибка при вводе строки')

    elif de == '3' :
    #В случае если пользователь ввел 3 эта наша третья команда (Добавление данных) это воспроизводит следующие монипуляции, если мы доюавляем целую строку или если надо к определенному элементу то команда в эксперементах
        print('Добавление запси ')
        h = input('Введите ФИО: ')
        k = input('Введите Адрес: ')
        p = input('Введите Телефон: ')
        q = input('Введите Дата рождения: ')
        #Вводим данные для добавления новой строки
        mns = a.DataFrame([{
            'ФИО': h, 
            'Адрес': k, 
            'Телефон': p, 
            'Дата рождения': q}])
        #А это уже мы задали новую строку с заданными ранее элементами
        d = a.concat([d, mns], ignore_index=True)
        print(f'Значение {mns} добавлено')

    elif de== '5':
        print(d)
    elif de == '4':
        print('Программа завершина ')
        break
    else:
        print('Неверно введена команда')
    
    
    
    
    
    
    
    
    #эКСПЕРЕМЕНТЫ
    # yd = int(input('Введите номер строки (индекс): '))
        #if yd in d.index: 
         #   print('Какой критерий вы хотете добавить?: (Варианты: ФИО, Адрес, Телефон, Дата рождения) ')
          #  cl = input('Введите критерий данных который вы хотите хотите добавить?: ')
           # if cl in d.columns:
            #    db = input('Введите новые данные: ')
             #   d.loc[yd , cl] = db
              #  print(f'К значение {cl} для строки {yd} Добавлено {db}')
            #else:





            # print('Удаление записи ')
        #yd = int(input('Введите номер строки (индекс): '))
        #if yd in d.index: 
            #print('Что именно вы хотите удалить?: (Варианты: ФИО, Адрес, Телефон, Дата рождения)')
            #cl = input('Введите критерий данных который вы хотите удалить?: ')
            #if cl in d.columns:
                #d.loc[yd , cl] = ''
                #print(f'{cl} удалено для {yd} строки')
            #else:
                #print('Ошибка при вводе критерия')
        #else:
            #print('Ошибка при вводе строки')
