import pandas as a
#Этой командой мы импортируем библиотеку для анализа данных    
data = {'ФИО' : 
            ['Петров Петр Петрович', 
            'Павлешевич Павел Палыч',
            'Алексадревич Александ Александрочич'] ,
        'Адрес':
             ['г.Минск ул.Пушкина д.Колотушкина',
             'г.Барановичи ул.Петровская д.19', 
             'г.Гродон ул.Павлика д.5'],
        'Телефон':
            ['+375294859656',
            '+375339876543',
            '+375301234567'], 
        'Дата рождения':
            ['17.08.2001',
            '31.04.20020',
            '24.09.1999']}
d = a.DataFrame(data)
print(d)
while True:
    print('Выберите действие: ')
    print('1.Удалить запись')
    print('2.Изменить запись')
    print('3.Добавить запись')
    print('4.Выход из программы')
    print('5.Просмотр адресной книги')
    de= input()
    if de == '1' :
        print('Удаление записи ')
        yd = int(input('Введите номер строки (индекс): '))
        if yd in d.index: 
            print('Что именно вы хотите удалить?: (Варианты: ФИО, Адрес, Телефон, Дата рождения)')
            cl = input('Введите критерий данных который вы хотите удалить?: ')
            if cl in d.columns:
                d.loc[yd , cl] = ''
                print(f'{cl} удалено для {yd} строки')
            else:
                print('Ошибка при вводе критерия')
        else:
            print('Ошибка при вводе строки')
    elif de == '2':
        print('Изменение записи ')
        yd = int(input('Введите номер строки (индекс): '))
        if yd in d.index: 
            print('Что именно вы хотите изменить?: (Варианты: ФИО, Адрес, Телефон, Дата рождения)')
            cl = input('Введите критерий данных который вы хотите тзменить?: ')
            if cl in d.columns:
                iz = input('Введите новые данные: ')
                d.loc[yd , cl] = iz
                print(f'Значение {cl} для строки {yd} изменено на {iz}')
            else:
                print('Ошибка при вводе критерия')
        else:
            print('Ошибка при вводе строки')
    elif de == '3' :
        print('Добавление запси ')
        yd = int(input('Введите номер строки (индекс): '))
        if yd in d.index: 
            print('Какой критерий вы хотете добавить?: (Варианты: ФИО, Адрес, Телефон, Дата рождения) ')
            сl = input('Введите критерий данных который вы хотите хотите добавить?: ')
            if cl in d.columns:
                db = input('Введите новые данные: ')
                d.loc[yd , cl] = db
                print(f'К значение {cl} для строки {yd} Добавлено {iz}')
            else:
                print('Ошибка при вводе критерия')
        else:
            print('Ошибка при вводе строки')
    elif de== '5':
        print(d)
    elif de == '4':
        print('Программа завершина ')
        break