import numpy as b
import matplotlib.pyplot as a
x = b.linspace(1, 5, 50)
#Команда создоет 50 точек в промежутке от 1 до 5
x_int = b.array([1, 2, 3, 4, 5])
#И задаем точечки для выделения их маркерами
#Строим графики и ставим маркеры
a.plot(x, x**2, 'k', x_int, x_int**2, 'ko')     
#Порабола, цвет- черный 'k'   и черные кружочки 'ko'
a.plot(x, b.exp(x), 'g', x_int, b.exp(x_int), 'gx') 
#Экспонента, цвет зеленый  'g' и зеленые крестики 'gx'
a.plot(x, b.log(x), 'm', x_int, b.log(x_int), 'ms') 
#Натуральный логорифм, цвет пурпурный и пурпурные квадратики
a.plot(x, x**3, 'y', x_int, x_int**3, 'y^')  
#Кубическая функция, цвет желтый и желтые треугольники         
a.legend(['$x^2$', '', '$e^x$', '', '$\ln(x)$', '', '$x^3$', ''], loc='upper left')
#Данная команда вместе с функциями выводит окно со значениеми: какой функцие соотствует каждый цвет и маркер
a.grid(True) 
#Эта команда включает отобраение координатной сетки
a.show()
#И завершающая команда которая выводит все что мы написали выше