import numpy as a
#Этой командой мы импортируем библиотеку для анализа данных 
N = int(input('Введите количчество строк '))
#Задание столбцов
M = int(input('Введите количчество столбцов '))
#Задание строк
m = a.random.randint(1, 10, size=(N, M))
#Создает матрицу размеров M на N состаящую из случайныъ чисел от 1 до 10
print(m)
mt = m.T  
# или np.transpose(matrix) оказывается есть команда которая создаёт траспонимрованную матрицу(подсмотренно в интернете)
print(mt)
if N == M:
    det1 = a.linalg.det(m)
    det2 = a.linalg.det(mt)
    if det1 > det2:
        print(f'Определитель начальной матрицы {det1} больше определителя трампонированной матрицы {det2} ')
    if det1 < det2:
        print(f'Определитель начальной матрицы {det1} меньше определителя трампонированной матрицы {det2} ')
    if det1 == det2:
        print('Определители матриц равны')
else:
    print('Невозможно вычеслить определители для этих матриц ')